Tekla Open API Reference for Tekla Structures 2025
AnalysisRigidDiaphragm.ExtremaMinimum Property
 The minimum of the extrema (in the global coordinate system).
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector ExtremaMinimum { get; set; }
Public Property ExtremaMinimum As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
AnalysisRigidDiaphragm Class
Tekla.Structures.Analysis Namespace